cask_args appdir: "/Applications"


brew "autoconf"
brew "automake"
brew "binutils"
brew "bash"
brew "bash-completion"
brew "bat"
brew "cmake"
brew "coreutils"
brew "csshx"
brew "diff-so-fancy"
brew "diffutils"
brew "ed"
brew "ffmpeg"
brew "findutils"
brew "fzf"
brew "gawk"
brew "gcc"
brew "git"
brew "git-extras"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "gnutls"
brew "go"
brew "grep"
brew "gzip"
brew "htop"
brew "iftop"
brew "jq"
brew "mas"
brew "moreutils"
brew "ncdu"
brew "openssl"
brew "opencv"
brew "pkg-config"
brew "prettyping"
brew "node"
brew "pandoc"
brew "python"
brew "pipenv"
brew "rbenv"
brew "rbenv-default-gems"
brew "shellcheck"
brew "tldr"
brew "tmux"
brew "trash"
brew "tree"
brew "vim"
brew "watch"
brew "wget", args: ["with-iri"]
brew "wdiff"
brew "youtube-dl"
brew "zsh"
brew "zsh-completions"

cask "alfred", link: true
cask "android-file-transfer"
cask "calibre"
cask "dotnet"
cask "dropbox"
cask "firefox"
cask "google-chrome"
cask "hiddenbar"
cask "iterm2"
cask "mactex"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"
cask "rectangle"
cask "skim"
cask "skype"
cask "spotify"
cask "sublime-text"
cask "teamviewer"
cask "telegram-desktop"
cask "xquartz"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"

mas "Create Booklet", id: 943029046
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "iPhoto", id: 408981381
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Amphetamine", id: 937984704
